const FAQData = [
    {
      id: 1,
      question: "Будет ли предоставлено руководство по установке и настройке IDE для веб-разработки?",
      answer: "Да, во время первого занятия наш инструктор проведет вас через процесс установки и настройки подходящей IDE, такой как Visual Studio Code, чтобы обеспечить плавный и продуктивный опыт обучения на протяжении всего семинара.",
    },
    {
      id: 2,
      question: "Для кого предназначен этот воркшоп?",
      answer: "Этот воркшоп разработан специально для подростков в возрасте от 12 до 19 лет, которые заинтересованы в изучении веб-разработки. Предварительный опыт не требуется.",
    },
    {
      id: 3,
      question: "Что я изучу на этом воркшопе?",
      answer: "Вы изучите основы веб-разработки, включая HTML, CSS и JavaScript. Воркшоп охватывает структуру веб-страниц, стилизацию, адаптивный дизайн, интерактивность и динамическое изменение содержимого.",
    },
    {
        id: 4,
        question: "Сколько длится воркшоп?",
        answer: "Воркшоп проходит в течение 7 недель, каждое занятие длится 2 часа. Последняя неделя посвящена работе над проектом, который включает в себя навыки и концепции, изученные на протяжении курса.",
    },
    {
      id: 5,
      question: "Что мне нужно, чтобы участвовать в этом воркшопе?",
      answer: "Вам потребуется компьютер с подключением к интернету и современным веб-браузером (например, Google Chrome, Firefox или Microsoft Edge). Мы рекомендуем иметь установленный текстовый редактор (например, Visual Studio Code или WebStorm) для написания кода.",
    },
    {
      id: 6,
      question: "Получу ли я сертификат после завершения воркшопа?",
      answer: "Да, после успешного завершения воркшопа и финального проекта вы получите сертификат об окончании.",
    },
    {
      id: 7,
      question: "Есть ли какие-либо требования для присоединения к воркшопу?",
      answer: "Предварительный опыт веб-разработки не требуется. Однако рекомендуются базовые компьютерные навыки и знание работы с веб-браузером.",
    },
    {
        id: 8,
        question: "Могу ли я присоединиться к воркшопу, если пропущу занятие?",
        answer: "Да, вы все равно можете участвовать в воркшопе. Ресурсы и материалы будут предоставлены для любых пропущенных занятий, чтобы помочь вам нагнать остальных участников.",
    },
    {
      id: 9,
      question: "Будет ли инструктор оказывать поддержку во время воркшопа?",
      answer: "Да, инструктор предоставит индивидуальное руководство и обратную связь на протяжении всего воркшопа. Инструктор будет доступен для ответа на вопросы, разъяснения концепций и оказания помощи во время практических занятий.",
    },
    {
      id: 10,
      question: "Какие проекты я могу ожидать создать во время воркшопа?",
      answer: "На протяжении воркшопа вы будете работать над различными практическими заданиями и финальным проектом. Финальный проект будет личным веб-сайтом или веб-приложением, которое включает в себя концепции HTML, CSS и JavaScript, изученные во время курса.",
    },
    {
      id: 11,
      question: "Есть ли дополнительные ресурсы для изучения веб-разработки после этого воркшопа?",
      answer: "Да, будут предоставлены рекомендации для дальнейшего обучения, включая онлайн-учебники, курсы и книги, чтобы помочь вам продолжить свое обучение веб-разработке после завершения воркшопа.",
    },
    {
      id: 12,
      question: "Какие платформы будут использоваться для общения во время воркшопа?",
      answer: "Мы будем использовать Zoom для проведения живых сессий, где инструктор будет учить, демонстрировать и предоставлять поддержку в реальном времени. Кроме того, Telegram будет использоваться в качестве инструмента связи для обмена ресурсами, ответов на вопросы и организации групповых обсуждений вне живых сессий. Это сочетание платформ обеспечивает бесперебойный опыт обучения и позволяет участникам оставаться на связи и вовлеченными на протяжении 7-недельного воркшопа",
    }



];
  
  export default FAQData;