const CourseOutlineData = [
    {
        week: 1,
        title: 'Введение в веб-разработку и HTML',
        topics: ['Обзор веб-разработки', 'Основы HTML и элементы', 'Атрибуты HTML'],
      },
      {
        week: 2,
        title: 'HTML: Структура и семантика',
        topics: ['Семантические элементы', 'Таблицы и формы', 'Создание иерархии содержимого'],
      },
      {
        week: 3,
        title: 'Введение в CSS: Стилизация и макет',
        topics: ['Основы CSS', 'Селекторы и свойства', 'Стилизация текста и фонов', 'Макет и позиционирование'],
      },
      {
        week: 4,
        title: 'CSS: Расширенные селекторы и техники',
        topics: [
          'Псевдоклассы и псевдоэлементы',
          'Преобразования, переходы и анимации',
          'Работа с адаптивным дизайном и медиазапросами',
          'Flexbox и Grid',
        ],
      },
      {
        week: 5,
        title: 'Введение в JavaScript: переменные, функции и события',
        topics: [
          'Основы JavaScript',
          'Переменные, типы данных и операторы',
          'Управляющие структуры (if, else, циклы)',
          'Функции и область видимости',
          'Обработка событий',
        ],
      },
      {
        week: 6,
        title: 'JavaScript: манипуляции с DOM',
        topics: [
          'Что такое Document Object Model (DOM)?',
          'Выбор и изменение элементов DOM',
          'Добавление и удаление элементов',
          'Динамическое изменение веб-страниц с помощью JavaScript',
        ],
      },
      {
        week: 7,
        title: 'Неделя проекта',
        topics: [
          'Задание и требования к проекту',
          'Планирование и дизайн проекта',
          'Разработка проекта',
          'Взаимное рецензирование и обратная связь',
          'Представление проектов и заключительные замечания',
        ],
      },
  ];
  
  export default CourseOutlineData;